In [2]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])

In [4]:
ps_tuple = pd.Series(('Max','John','Jeremy','Patty','Sunny','Ahemad'))
ps_tuple

0       Max
1      John
2    Jeremy
3     Patty
4     Sunny
5    Ahemad
dtype: object

In [5]:
ps_list = pd.Series(['Max','John','Jeremy','Patty','Sunny','Ahemad'])
ps_list

0       Max
1      John
2    Jeremy
3     Patty
4     Sunny
5    Ahemad
dtype: object

## Create Panda dataframe

### 1. Creat panda dataframe using the panda series without parameter

In [6]:
d = {
    "one"  : pd.Series([1, 2, 3], index=["a", "b", "c"]),
    "two"  : pd.Series([4, 5, 6, 7], index=["a", "b", "c", "d"]),
    "three"  : pd.Series([8, 9, 10, 11], index=["a", "b", "c", "d"])
}

In [7]:
df = pd.DataFrame(d)
df

   one  two  three
a  1.0    4      8
b  2.0    5      9
c  3.0    6     10
d  NaN    7     11

In [8]:
df.dtypes

one      float64
two        int64
three      int64
dtype: object

#### 1. Problem 1: when the length of the series and index column is not matched, you will get below exception.
- ValueError: Length of values (4) does not match length of index (3)

In [ ]:
d = {
    "one"  : pd.Series([1, 2, 3], index=["a", "b", "c"]),
    "two"  : pd.Series([4, 5, 6,3], index=["a", "b", "c"]),
    "three"  : pd.Series([8, 9, 10, 11], index=["a", "b", "c","d"])
}
df = pd.DataFrame(d)
df

#### 1. Problem 2: When we have in the index in different order.
- ValueError: Length of values (4) does not match length of index (3)

In [123]:
d = {
    "one"  : pd.Series([1, 2, 3], index=["a", "b", "c"]),
    "two"  : pd.Series([4, 5, 6], index=["a", "b", "c"]),
    "three"  : pd.Series([8, 9, 10, 11], index=["a", "e", "d","c"])
}
df = pd.DataFrame(d)
df

   one  two  three
a  1.0  4.0    8.0
b  2.0  5.0    NaN
c  3.0  6.0   11.0
d  NaN  NaN   10.0
e  NaN  NaN    9.0

### 2. Creat panda dataframe using the indexes and columns parameter
    - to select the subset of the data

In [40]:
d = {
    "one"  : pd.Series([1, 2, 3], index=["a", "b", "c"]),
    "two"  : pd.Series([4, 5, 6], index=["a", "b", "c"]),
    "three"  : pd.Series([8, 9, 10, 11], index=["a", "e", "d","c"])
}
df = pd.DataFrame(d,index=['a','b','e'], columns=["one", "two"])
df

# df

   one  two
a  1.0  4.0
b  2.0  5.0
e  NaN  NaN

### 3. Creat panda dataframe using dictionary
    - to

In [122]:
d = {
    "one"  : [1, 2, 3],
    "two"  : [4, 5, 6],
    "three"  : [8, 9, 10] }
df = pd.DataFrame(d)
df.dtypes

one      int64
two      int64
three    int64
dtype: object

In [52]:
d = {
    "one"  : [1, 2, 3],
    "two"  : [4, 5, 6],
    "three"  : [8, 9, 10] }
df = pd.DataFrame(d, index=['a','b','c'] ,columns=["one", "two"])
df

   one  two
a    1    4
b    2    5
c    3    6

### From structured or record array

In [56]:
data = np.zeros((2,), dtype=[("A", "i4"), ("B", "f4"), ("C", "a10")])

In [57]:
type(data)

numpy.ndarray

In [58]:
data

array([(0, 0., b''), (0, 0., b'')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [65]:
d = [
     (1, 2.0, "Hello"),
     (2, 3.0, "World")
     ]

In [67]:
pd.DataFrame(d, index=["First","Second"] ,columns=["one", "two", "three"])

        one  two  three
First     1  2.0  Hello
Second    2  3.0  World

In [87]:
d = [{"a": 1, "b": 2}, {"a": 5, "b": 10, "c": 20}]
df = pd.DataFrame(d,index=["row1", "row2"],columns=["a","b","c"] )
df

In [88]:
df

      a   b     c
row1  1   2   NaN
row2  5  10  20.0

### Create Panda Dataframe using list of namedtuple

In [95]:
from collections import namedtuple

Point = namedtuple("Point", "x y")

point1=  Point(1, 2)
point2 = Point(2,3)
point3 = Point(4,4)
points = [point1, point2, point3]

pointsdf = pd.DataFrame(points, index=["first","second","third"], columns=["pointx","pointy"])
pointsdf

        pointx  pointy
first        1       2
second       2       3
third        4       4

### Create Panda Dataframe using list of make_dataclasses

In [98]:
from dataclasses import make_dataclass

# you can defined the named tupled with given datatypes as shown below

In [99]:
Point = make_dataclass("Point", [("x", int), ("y", int)])

In [100]:
point1 = Point(2,3)
point2 = Point(4,5)
point3 = Point(6,7)
points = [point1, point2, point3]

# create panda dataframe with the makeclass

In [105]:
df = pd.DataFrame(points, index=["row1","row2","row3"])
df

      x  y
row1  2  3
row2  4  5
row3  6  7

In [106]:
df.dtypes

x    int64
y    int64
dtype: object

In [119]:
data = {
 "A": [1, 2, 3],
 "B": [4, 5, 6]   
}


df = pd.DataFrame.from_dict( data , orient="index",columns=["col1", "col2", "col3"])
df

   col1  col2  col3
A     1     2     3
B     4     5     6